src/Documents/ОтчетОСоставеСмены/ОтчетОСоставеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОСоставеСмены</name>
  <comment>(Упр)</comment>
  <basedOn>Document.ОтчетМастераСмены</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставСмены</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоГрафику</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Явка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЯвки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработанноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещающийСотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЗавершенныеСмены/ЗавершенныеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗавершенныеСмены</name>
  <resources>
    <name>ГраницаСмены</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ОтчетОСоставеСмены/Forms/ФормаДокументаУправляемая/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(ДокументОбъект, ЭтаФорма);
		
		УстановитьПривилегированныйРежим(Истина);
		Если НЕ РольДоступна("ПолныеПрава")
			И Объект.ГраницаСмены <= РегистрыСведений.ЗавершенныеСмены.Получить(Новый Структура("Подразделение", Объект.Подразделение)).ГраницаСмены Тогда
			
			ТолькоПросмотр = Истина;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// СОХРАНЕНИЕ И ВОССТАНОВЛЕНИЕ ДАННЫХ ИЗ НАСТРОЕК

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	ХранилищаНастроек.ДанныеФорм.ДобавитьДополнительныеДанныеВНастройку(Объект, Настройки, Документы.ОтчетОСоставеСмены.СтруктураДополнительныхДанныхФормы());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ХранилищаНастроек.ДанныеФорм.ЗаполнитьОбъектДополнительнымиДанными(Объект, Настройки, Документы.ОтчетОСоставеСмены.СтруктураДополнительныхДанныхФормы());
	Модифицированность = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Управляет доступностью реквизитов в строке табличного поля СоставСмены.
//
// Табличное поле имеет две группы реквизитов - для явки и для неявки.
//
&НаКлиенте
Процедура УправлениеДоступностьюРеквизитовВСтрокеСоставСмены()
	
	ДанныеСтроки = Элементы.СоставСмены.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Запрещаем редактировать поля, имеющие смысл только при явке или только при неявке.
	Элементы.СоставСменыВремяЯвки.ТолькоПросмотр 			= НЕ ДанныеСтроки.Явка;
	Элементы.СоставСменыОтработанноеВремя.ТолькоПросмотр 	= НЕ ДанныеСтроки.Явка;
	Элементы.СоставСменыЗамещающийСотрудник.ТолькоПросмотр	= ДанныеСтроки.Явка;
	
	//Запрещаем редактировать сотрудника, имеющегося в графике
	Элементы.СоставСменыСотрудник.ТолькоПросмотр = ДанныеСтроки.ПоГрафику;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - СОСТАВ СМЕНЫ

&НаСервере
Процедура ЗаполнитьСоставомТекущейСмены()

	Объект.СоставСмены.Очистить();
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьСоставомТекущейСмены();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры
 
&НаКлиенте
Процедура КомандаЗаполнитьСоставомТекущейСмены(Команда)
	
	Если Объект.СоставСмены.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'"), РежимДиалогаВопрос.ДаНет, , , НСтр("ru='Заполнение списка сотрудников'"));
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСоставомТекущейСмены();
	
	// Выведем сообщение, чтобы избежать ситуации "нажал на кнопку - ничего не произошло"
	Если Объект.СоставСмены.Количество() = 0 Тогда
		Предупреждение(НСтр("ru = 'Данные для заполнения отсутствуют'"),,НСтр("ru='Заполнение списка сотрудников'"));
	КонецЕсли;
	
КонецПроцедуры

// Выполняет необходимые действия после добавления новой строки
//
// Параметры
//  ДанныеСтроки - данные добавленной строки
//
&НаКлиенте
Процедура ДобавлениеСтроки(ДанныеСтроки)
	
	ДанныеСтроки.Явка 		= Истина;
	ДанныеСтроки.ПоГрафику 	= Ложь;
	ИзменениеЯвки(ДанныеСтроки);
	
КонецПроцедуры

// Выполняет необходимые действия при изменении флага явки в строке
//
// Параметры
//  ДанныеСтроки - данные измененной строки
//
&НаКлиенте
Процедура ИзменениеЯвки(ДанныеСтроки)
	
	Если НЕ ДанныеСтроки.Явка Тогда
		ДанныеСтроки.ВремяЯвки 			= Неопределено;
		ДанныеСтроки.ОтработанноеВремя 	= Неопределено;
	Иначе
		ДанныеСтроки.ЗамещающийСотрудник= Неопределено;
	КонецЕсли;
	
	//Если это текущая редактируемая строка, то настроим доступность полей
	Если ДанныеСтроки = Элементы.СоставСмены.ТекущиеДанные Тогда
		УправлениеДоступностьюРеквизитовВСтрокеСоставСмены();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСменыЯвкаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.СоставСмены.ТекущиеДанные;
	ИзменениеЯвки(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСменыПередУдалением(Элемент, Отказ)
	
	ДанныеСтроки = Элементы.СоставСмены.ТекущиеДанные;
	Если ДанныеСтроки <> Неопределено Тогда
		
		Если ДанныеСтроки.ПоГрафику Тогда
			//Нельзя удалить из списка сотрудника, работающего по графику.
			//Воспримем это как намерение поставить неявку.
			//Если уже стоит неявка - то сообщим.
			Отказ = Истина;
			
			Если ДанныеСтроки.Явка Тогда
				ДанныеСтроки.Явка 	= Ложь;
				ИзменениеЯвки(ДанныеСтроки);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru = 'Нельзя удалить из списка сотрудника, который согласно графику должен был выйти на работу.'"),,
					"СоставСмены");
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСменыПриАктивизацииСтроки(Элемент)
	
	УправлениеДоступностьюРеквизитовВСтрокеСоставСмены();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСменыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ДанныеСтроки = Элементы.СоставСмены.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ДобавлениеСтроки(ДанныеСтроки);
	КонецЕсли;
	
КонецПроцедуры
